#!/usr/bin/env python
# coding: utf-8

# # 药品销售数据分析

# 一、数据加载（5分）

# In[ ]:





# 二、查看数据基本信息（5分）
# * 查看数据信息（3分）

# In[ ]:





# * 把原列名-购药时间改为新列名-销售时间（2分）

# In[ ]:





# ##### 三、重复值处理（5分）

# In[ ]:





# ##### 四、缺失值处理（5分）

# In[ ]:





# 五、异常值处理（20分）
# * 统一数据格式（10分）
#     * 将销售数量的数据类型转换为整型（5分）
#     * 将销售时间的格式统一为DateTime格式（5分）

# In[ ]:





# * 处理销售数量、应收金额、实收金额这三列的异常值（10分）

# In[ ]:





# 六、数据分析（30分）

# * 将数据按照销售时间从小到大进行排序，排序之后重置行索引（5分）

# In[ ]:





# * 计算月均消费金额（5分）

# In[ ]:





# * 绘制销售时间与实收金额的关系（可采用折线图、散点图或者其他图表）（5分）

# In[ ]:





# * 根据星期分组，统计每星期销售数量、应收金额和实收金额的关系绘制在一张图中（可采用折线图、柱状图或者其他图表,可以绘制一个坐标系，也可以绘制多个坐标系）（5分）

# In[ ]:





# * 根据商品名称分组，统计销售数量前十位的药品，绘制销售数量前十位的药品名称的销售数量关系（可采用柱状图、饼图或者其他图表）（10分）

# In[ ]:





# 七、项目答辩（30分）

# In[ ]:




